export const emojiMapping = {
  SMILE: ["🙂", ":)"],
  SMILE_CLOSED_EYES: ["😊", "😊", "😇", "^_^"],
  SUNGLASSES: ["😎", "B)", "8)"],
  GRIN: ["😀", "😁", "😄", "😸", ":D"],
  EX_DEE: ["😆", "🤣", "😹", "😂", "XD", "xd", "xD"],
  BLEP: ["👅", "😛", "😜", "😝", "😋", "🤪", ":P", ":p", ";P", ";p"],
  COLON_THREE: ["🐱", "😺", ":3"],
  WINK: ["😉", ";)"],
  // need to check >:( before :( or it'll print sad when you want angry haha
  ANGRY: ["😠", "😡", "🤬", "💢", "😤", ">:(", ">:|", ">:/", ">:\\"],
  HUH: ["😐", "😑", "😶", "😒", "🙄", ":|", ":/", ":\\"],
  SAD: ["🙁", "😦", "☹️", "😢", "😭", "😔", "😟", "😞", "😿", ":(", ":'("],
  // why are there so many sad emojis
};
